"use strict";
// Простое общение с пользователем.
// Любая информация которая приходит от пользователя - приходит в виду строк 'string';

// alert("Hello World"); // Выводит на экран таблицу с сообщением.

// const result = confirm("Are you here?"); // Выводит на страницу сообщением с возможностью ответа Да / Нет.
// console.log(result);

// const answer = +prompt("Вам есть 18?", "18"); // Выводит сообщение и создаёт блок с возможностью напечатать текст.
// // +prompt - назначает в числа тип данных, по умолчанию 'string';
// console.log(typeof answer); // typeof - показывает тип данных.

const answers = [];

// answers[0] = prompt("Как ваше имя?", "");
// answers[1] = prompt("Как ваша фамилия?", "");
// answers[2] = prompt("Сколько вам лет?", "");

// document.write(answers); Заменяет весь контент сайта на данные полученные с answers
