"use strict";

// Унарный плюсик это плюсик который ставиться перед аргументом
console.log("arr" + " - objeect"); // строка + строка
console.log(4 + +" - object"); // число + строка = Nan Error
console.log(4 + +"5"); // 5 из строки превратилась в число = 9

// Инкремент и декремент
let incr = 10,
  decr = 10;

// Постфиксной формой записи
incr++; // Инкремент - увеличение значения на еденицу.
decr--; // Декремент - уменьшение значения на еденицу.
// Постфиксная форма сначала возвращает старое значение, т.е = 10
console.log(incr++);
console.log(decr--);

// Префиксной формой записи
++incr; // Инкремент - увеличение значения на еденицу.
--decr; // Декремент - уменьшение значения на еденицу.
// Префиксная форма увеличивает значение сразу же = 11,9
console.log(++incr);
console.log(--decr);

// Оператор %, делит значение.
console.log(5 % 2); // поделили 5 на 2 столько, сколько это возможно. = 1

// Равенство =, сравнивает значение.

// Простое - не проверяет на тип данных. Если второе значением будет строкой '8' то ответ всё равно будет true.
console.log(2 * 4 == 8); // сравнивает ответ калькуляции с описанным вторым значением.

// Строгое - проверяет на тип данных.
console.log(2 * 4 === "8"); // число 8 не равняется строки 8.

// Логический оператор ( и, или ).
// && - и. Работает когда 2 или больше подобных являются правдивыми выражениями.
const isChecked = true,
  isClose = true;

console.log(isChecked && isClose); // Проверяет если все элементы true.

// || - или. Работает когда хотя бы одно выражение правдовое.
const isCheckedIli = true,
  isCloseIli = false;

console.log(isCheckedIli || isCloseIli); // Проверяет если хотя бы один элемент true.

// ! - оператор отрицание.
// Обращает значение в обратное. true - false, false - true.
const isCheckedNegative = false,
  isCloseNegative = false;

console.log(isCheckedNegative || !isCloseNegative);

console.log(2 + 2 * 2 !== 8); // 6 не равен 8 = true  != - простое равенство, !== - строгое равенство.

// Порядок выполнение операторов.
console.log(2 + 2 * 2 === 8); // Сначала умножение, потом прибавление. 6 не равно 8
