"use strict";

/* Условия - превращает все типы данных в булиновые(true, false), чтобы проверить значение.*/

if (4 == 4) {
  // if - если, если 4 == 4 то выведится сообщение 'Ok!', если например 4 == 9, то никакого сообщение не будет.
  console.log("Ok!");
}

// else - если 4 не будет равно 9, то будет сообщение 'Error'
if (4 == 9) {
  console.log("Ok!");
} else {
  console.log("Error");
}

const num = 50;

if (num < 49) {
  // Если значение num меньше 49 - Error
  console.log("Error");
} else if (num > 100) {
  // Если значение num больше 100 - Много
  console.log("Много");
} else {
  // Если не выполнились условия выше
  console.log("Ok!");
}

// Тернарный оператор - в его работе используется 3 аргумента.
num === 50 ? console.log("Ok!") : console.log("Error");
// проверяется переменная, если она соответствует значению 50.
// ? - оператор, если соответствует.
// : - оператор, если не соответствует.

// Конструкция switch идёт всегда на строгое сравнение!!!
// значение = значение, строка = строка, число = число.
// break - обязательный синтаксический элемент.
// default - если не один из элементов не прошёл.
const number = 50;

switch (number) {
  case 49:
    console.log("Неверено");
    break;
  case 100:
    console.log("Неверено");
    break;
  case 50:
    console.log("Верно!");
    break;
  default:
    console.log("Не в этот раз!");
    break;
}
